Unfortunately the two-pass apply doesn't work either, fails for the same reason:

Pass 1, just the challenge and the data source (applies successfully):
```
$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_s3_bucket_object.challenge_file will be read during apply
  # (config refers to values not yet known)
 <= data "aws_s3_bucket_object" "challenge_file"  {
      + body                          = (known after apply)
      + bucket                        = "[BUCKET_NAME]"
      + cache_control                 = (known after apply)
      + content_disposition           = (known after apply)
      + content_encoding              = (known after apply)
      + content_language              = (known after apply)
      + content_length                = (known after apply)
      + content_type                  = (known after apply)
      + etag                          = (known after apply)
      + expiration                    = (known after apply)
      + expires                       = (known after apply)
      + id                            = (known after apply)
      + key                           = (known after apply)
      + last_modified                 = (known after apply)
      + metadata                      = (known after apply)
      + object_lock_legal_hold_status = (known after apply)
      + object_lock_mode              = (known after apply)
      + object_lock_retain_until_date = (known after apply)
      + server_side_encryption        = (known after apply)
      + sse_kms_key_id                = (known after apply)
      + storage_class                 = (known after apply)
      + tags                          = (known after apply)
      + version_id                    = (known after apply)
      + website_redirect_location     = (known after apply)
    }

  # cloudflare_logpush_ownership_challenge.challenge will be created
  + resource "cloudflare_logpush_ownership_challenge" "challenge" {
      + destination_conf             = "s3://[BUCKET_NAME]/[ZONE_NAME]?region=us-east-1"
      + id                           = (known after apply)
      + ownership_challenge_filename = (known after apply)
      + zone_id                      = "[ZONE_ID]"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

cloudflare_logpush_ownership_challenge.challenge: Creating...
cloudflare_logpush_ownership_challenge.challenge: Creation complete after 1s [id=6c6393e110c08d3b1bbb894e8ca148ca]
data.aws_s3_bucket_object.challenge_file: Reading...
data.aws_s3_bucket_object.challenge_file: Read complete after 5s [id=[BUCKET_NAME]/[ZONE_NAME]/ownership-challenge-cec5bfcb.txt]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

Pass 2: adding back in the job (fails, same error as before):
```
$ terraform apply
cloudflare_logpush_ownership_challenge.challenge: Refreshing state... [id=6c6393e110c08d3b1bbb894e8ca148ca]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_logpush_job.http_requests_job will be created
  + resource "cloudflare_logpush_job" "http_requests_job" {
      + dataset             = "http_requests"
      + destination_conf    = "s3://[BUCKET_NAME]/[ZONE_NAME]/{DATE}?region=us-east-1"
      + enabled             = true
      + id                  = (known after apply)
      + logpull_options     = "fields=CacheCacheStatus,CacheResponseBytes,...,ZoneName&timestamps=rfc3339"
      + name                = "[ZONE_NAME]"
      + ownership_challenge = "[REDACTED]"
      + zone_id             = "[ZONE_ID]"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

cloudflare_logpush_job.http_requests_job: Creating...

Error: error creating logpush job: HTTP status 400: incorrect ownership challenge (1002)

  on main.tf line 19, in resource "cloudflare_logpush_job" "http_requests_job":
  19: resource "cloudflare_logpush_job" "http_requests_job" {
```

Again, the value displayed in `ownership_challenge` above matches what's in the challenge file in S3.  I even tried hardcoding that value directly into the definition of the job (thereby getting rid of any terraform dependency shenanigans), and it still fails with the `incorrect ownership challenge` error.